# Pandas - DataFrame and series 
- data manipulation capabilities
- data cleaning 
- series(one-dimensional) and Dataframe(two-dimensional)

In [5]:
import pandas as pd

data=[1,2,3,4,5]
series=pd.Series(data)
print(series)
print(type(series))

0    1
1    2
2    3
3    4
4    5
dtype: int64
<class 'pandas.core.series.Series'>

In [6]:
# create a series from dictionary elements
data={'a':1,'b':2,'c':3}
series_dict=pd.Series(data)
print(series_dict)

a    1
b    2
c    3
dtype: int64

In [7]:
data=[10,20,40]
index=['a','b','c']
pd.Series(data,index=index)

a    10
b    20
c    40
dtype: int64

In [10]:
## dataframe
## create a dataframe from a dictionary of list
data={
    'Name':['Krish','John','Jack'],
    'Age':[25,30,45],
    'City':['Bangalore','New York','Florida']
}

df=pd.DataFrame(data)
print(df)
print(type(df))

    Name  Age       City
0  Krish   25  Bangalore
1   John   30   New York
2   Jack   45    Florida
<class 'pandas.core.frame.DataFrame'>

In [11]:
## create a dataframe from a list of dictionaries 
data = [
    {'Name': 'Krish', 'Age': 32, 'City': 'Bangalore'},
    {'Name': 'Aarav', 'Age': 28, 'City': 'Mumbai'},
    {'Name': 'Neha', 'Age': 24, 'City': 'Delhi'},
    {'Name': 'Rohan', 'Age': 35, 'City': 'Hyderabad'},
    {'Name': 'Meera', 'Age': 29, 'City': 'Chennai'},
    {'Name': 'Vikram', 'Age': 40, 'City': 'Pune'},
    {'Name': 'Sonia', 'Age': 31, 'City': 'Kolkata'},
    {'Name': 'Arjun', 'Age': 27, 'City': 'Ahmedabad'},
    {'Name': 'Priya', 'Age': 30, 'City': 'Jaipur'},
    {'Name': 'Rahul', 'Age': 33, 'City': 'Surat'},
    {'Name': 'Kavita', 'Age': 26, 'City': 'Lucknow'},
    {'Name': 'Manish', 'Age': 36, 'City': 'Nagpur'},
    {'Name': 'Anjali', 'Age': 25, 'City': 'Patna'},
    {'Name': 'Harish', 'Age': 38, 'City': 'Indore'},
    {'Name': 'Nisha', 'Age': 22, 'City': 'Bhopal'},
    {'Name': 'Vivek', 'Age': 34, 'City': 'Ludhiana'},
    {'Name': 'Pooja', 'Age': 23, 'City': 'Agra'},
    {'Name': 'Ajay', 'Age': 37, 'City': 'Varanasi'},
    {'Name': 'Divya', 'Age': 28, 'City': 'Nashik'},
    {'Name': 'Ravi', 'Age': 39, 'City': 'Amritsar'}
]
df=pd.DataFrame(data)
print(df)
print(type(df))

      Name  Age       City
0    Krish   32  Bangalore
1    Aarav   28     Mumbai
2     Neha   24      Delhi
3    Rohan   35  Hyderabad
4    Meera   29    Chennai
5   Vikram   40       Pune
6    Sonia   31    Kolkata
7    Arjun   27  Ahmedabad
8    Priya   30     Jaipur
9    Rahul   33      Surat
10  Kavita   26    Lucknow
11  Manish   36     Nagpur
12  Anjali   25      Patna
13  Harish   38     Indore
14   Nisha   22     Bhopal
15   Vivek   34   Ludhiana
16   Pooja   23       Agra
17    Ajay   37   Varanasi
18   Divya   28     Nashik
19    Ravi   39   Amritsar
<class 'pandas.core.frame.DataFrame'>

In [14]:
df=pd.read_csv('test_dir/sales_data.csv')
df.head()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal

In [15]:
df.tail()

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [41]:
## accessing data from dataframe 
print(df['Date'])
type(df['Date'])

0      2024-01-01
1      2024-01-02
2      2024-01-03
3      2024-01-04
4      2024-01-05
          ...
235    2024-08-23
236    2024-08-24
237    2024-08-25
238    2024-08-26
239    2024-08-27
Name: Date, Length: 240, dtype: object

pandas.core.series.Series

In [42]:
# loc - pass the row index and column names  
df.loc[0:3,['Date','Region']]

         Date         Region
0  2024-01-01  North America
1  2024-01-02         Europe
2  2024-01-03           Asia
3  2024-01-04  North America

In [44]:
# iloc - pass the index only 
df.iloc[:,[1,7]]

           Date         Region
0    2024-01-01  North America
1    2024-01-02         Europe
2    2024-01-03           Asia
3    2024-01-04  North America
4    2024-01-05         Europe
..          ...            ...
235  2024-08-23         Europe
236  2024-08-24           Asia
237  2024-08-25  North America
238  2024-08-26         Europe
239  2024-08-27           Asia

[240 rows x 2 columns]

In [48]:
## Accessing a specified element 
# 
# 
df.at[2,'Region']

'Asia'

In [51]:
## Accessing a specified element using iat 
df.iat[2,2]

'Clothing'

In [52]:
## datamanipulation with dataframes 
df['Total_Revenue_All']=df['Unit Price']*df['Units Sold']

In [53]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method,Total_Revenue_All
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card,1999.98
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal,499.99
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card,209.97
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card,63.96
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal,89.99
...,...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal,159.99
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card,270.00
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card,32.97
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal,55.00
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card,59.98

In [56]:
## remove a column 
df.drop('Total_Revenue_All',axis=1,inplace=True)

In [57]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,2,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,1,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,3,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,4,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,1,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,1,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,3,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,3,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,1,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,2,29.99,59.98,Asia,Credit Card

In [59]:
df['Units Sold']=df['Units Sold']+1
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,4,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,3,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,5,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,6,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,3,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,3,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,5,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,5,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,3,55.00,55.00,Europe,PayPal
239,10240,2024-08-27,Sports,Yeti Rambler 20 oz Tumbler,4,29.99,59.98,Asia,Credit Card

In [61]:
## remove a row
df.drop(239,inplace=True)

In [62]:
df

,Transaction ID,Date,Product Category,Product Name,Units Sold,Unit Price,Total Revenue,Region,Payment Method
0,10001,2024-01-01,Electronics,iPhone 14 Pro,4,999.99,1999.98,North America,Credit Card
1,10002,2024-01-02,Home Appliances,Dyson V11 Vacuum,3,499.99,499.99,Europe,PayPal
2,10003,2024-01-03,Clothing,Levi's 501 Jeans,5,69.99,209.97,Asia,Debit Card
3,10004,2024-01-04,Books,The Da Vinci Code,6,15.99,63.96,North America,Credit Card
4,10005,2024-01-05,Beauty Products,Neutrogena Skincare Set,3,89.99,89.99,Europe,PayPal
...,...,...,...,...,...,...,...,...,...
234,10235,2024-08-22,Electronics,Bose QuietComfort 35 II Wireless Headphones,3,299.00,299.00,North America,Credit Card
235,10236,2024-08-23,Home Appliances,Nespresso Vertuo Next Coffee and Espresso Maker,3,159.99,159.99,Europe,PayPal
236,10237,2024-08-24,Clothing,Nike Air Force 1 Sneakers,5,90.00,270.00,Asia,Debit Card
237,10238,2024-08-25,Books,The Handmaid's Tale by Margaret Atwood,5,10.99,32.97,North America,Credit Card
238,10239,2024-08-26,Beauty Products,Sunday Riley Luna Sleeping Night Oil,3,55.00,55.00,Europe,PayPal

In [63]:
# displat the data types of each column 
print(df.dtypes)

Transaction ID        int64
Date                 object
Product Category     object
Product Name         object
Units Sold            int64
Unit Price          float64
Total Revenue       float64
Region               object
Payment Method       object
dtype: object

In [64]:
print(df.describe())

       Transaction ID  Units Sold   Unit Price  Total Revenue
count      239.000000  239.000000   239.000000     239.000000
mean     10120.000000    4.158996   237.259205     336.853013
std         69.137544    1.325189   430.139050     486.494450
min      10001.000000    3.000000     6.500000       6.500000
25%      10060.500000    3.000000    29.500000      64.455000
50%      10120.000000    4.000000    89.990000     179.970000
75%      10179.500000    5.000000   249.990000     399.450000
max      10239.000000   12.000000  3899.990000    3899.990000

In [67]:
print(df.groupby('Product Category')['Units Sold'].mean())
print(df.groupby('Product Category')['Total Revenue'].mean())

Product Category
Beauty Products    3.150000
Books              4.850000
Clothing           5.625000
Electronics        3.650000
Home Appliances    3.475000
Sports             4.205128
Name: Units Sold, dtype: float64
Product Category
Beauty Products     65.547500
Books               46.548250
Clothing           203.223250
Electronics        874.560250
Home Appliances    466.154000
Sports             365.808718
Name: Total Revenue, dtype: float64

# Data Manipulation and analysis with Pandas

In [2]:
import pandas as pd


data=pd.read_csv('test_dir/data.csv')
data.head()

         Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North

In [3]:
data.describe()

           Value       Sales
count  47.000000   46.000000
mean   51.744681  557.130435
std    29.050532  274.598584
min     2.000000  108.000000
25%    27.500000  339.000000
50%    54.000000  591.500000
75%    70.000000  767.500000
max    99.000000  992.000000

In [7]:
data.dtypes

Date         object
Category     object
Value       float64
Product      object
Sales       float64
Region       object
dtype: object

In [19]:
## Handling missing values
data.isnull().sum()

Date        0
Category    0
Value       3
Product     0
Sales       4
Region      0
dtype: int64

In [21]:
data.isnull().any(axis=1)

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11     True
12    False
13    False
14    False
15     True
16    False
17     True
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28     True
29    False
30    False
31    False
32    False
33     True
34    False
35     True
36    False
37     True
38    False
39    False
40    False
41    False
42    False
43    False
44    False
45    False
46    False
47    False
48    False
49    False
dtype: bool

In [23]:
# filling missing values 
df_filled=data.fillna(0)

In [36]:
# filling missing values with mean of the values 
data['Sales'].fillna(data['Sales'].mean(),inplace=True)
data['Value'].fillna({'Value': data['Value'].mean()},inplace=True)

C:\Users\26amr\AppData\Local\Temp\ipykernel_29096\3093019536.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  data['Value'].fillna({'Value': data['Value'].mean()},inplace=True)

In [37]:
data.isnull().sum()

Date        0
Category    0
Value       0
Product     0
Sales       0
Region      0
dtype: int64

In [44]:
# renaming a column
data.rename(columns={'Date':'Sale_Date'},inplace=True)
#print(data.head())

#renaming multiple columns
multiple_columnname_change={
    'Date':'Sale_Date',
    'Category':'Item_Category',
    'Product':'Item_Product',
    'Region':'Sale_Region'
}
data.rename(columns=multiple_columnname_change,inplace=True)
print(data.head())

    Sale_Date Category  Value   Product  Sales Region
0  2023-01-01        A   28.0  Product1  754.0   East
1  2023-01-02        B   39.0  Product3  110.0  North
2  2023-01-03        C   32.0  Product2  398.0   East
3  2023-01-04        B    8.0  Product1  522.0   East
4  2023-01-05        B   26.0  Product3  869.0  North
    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region
0  2023-01-01             A   28.0     Product1  754.0        East
1  2023-01-02             B   39.0     Product3  110.0       North
2  2023-01-03             C   32.0     Product2  398.0        East
3  2023-01-04             B    8.0     Product1  522.0        East
4  2023-01-05             B   26.0     Product3  869.0       North

In [47]:
# change the datatypes
data.head()
data['Sales_int']=data['Sales'].astype(int)
print(data.head())

    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East        754
1  2023-01-02             B   39.0     Product3  110.0       North        110
2  2023-01-03             C   32.0     Product2  398.0        East        398
3  2023-01-04             B    8.0     Product1  522.0        East        522
4  2023-01-05             B   26.0     Product3  869.0       North        869

In [50]:
data['Sales_int']=data['Sales_int']+data['Sales_int']*0.1
print(data.head())

##using lambda function 
data['Sales_int']=data['Sales_int'].apply(lambda x:x+x*0.1)
print(data.head())

    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East   1003.574
1  2023-01-02             B   39.0     Product3  110.0       North    146.410
2  2023-01-03             C   32.0     Product2  398.0        East    529.738
3  2023-01-04             B    8.0     Product1  522.0        East    694.782
4  2023-01-05             B   26.0     Product3  869.0       North   1156.639
    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East  1103.9314
1  2023-01-02             B   39.0     Product3  110.0       North   161.0510
2  2023-01-03             C   32.0     Product2  398.0        East   582.7118
3  2023-01-04             B    8.0     Product1  522.0        East   764.2602
4  2023-01-05             B   26.0     Product3  869.0       North  1272.3029

In [53]:
# data Aggregating and grouping 
print(data.head())
groupby_mean=data.groupby('Item_Product')['Sales'].mean()
print(groupby_mean)

groupby_sum=data.groupby('Item_Product')['Sales'].sum()
print(groupby_sum)

    Sale_Date Item_Category  Value Item_Product  Sales Sale_Region  Sales_int
0  2023-01-01             A   28.0     Product1  754.0        East  1103.9314
1  2023-01-02             B   39.0     Product3  110.0       North   161.0510
2  2023-01-03             C   32.0     Product2  398.0        East   582.7118
3  2023-01-04             B    8.0     Product1  522.0        East   764.2602
4  2023-01-05             B   26.0     Product3  869.0       North  1272.3029
Item_Product
Product1    573.758152
Product2    565.884058
Product3    536.217391
Name: Sales, dtype: float64
Item_Product
Product1     9180.130435
Product2     8488.260870
Product3    10188.130435
Name: Sales, dtype: float64

In [55]:
## group by 2 categorical variables 
groupby_Category_Product=data.groupby(['Item_Category','Item_Product'])['Value'].mean()
print(groupby_Category_Product)

Item_Category  Item_Product
A              Product1        46.800000
               Product2        28.200000
               Product3        75.500000
B              Product1         9.000000
               Product2        73.000000
               Product3        51.843085
C              Product1        68.641337
               Product2        61.714286
               Product3        46.857143
Name: Value, dtype: float64

In [58]:
## aggregate multiple functions 
grouped_agg=data.groupby('Sale_Region')['Value'].agg(['mean','sum','count'])
grouped_agg

                  mean          sum  count
Sale_Region
East         42.307692   550.000000     13
North        40.226306   442.489362     11
South        62.000000   496.000000      8
West         61.041371  1098.744681     18

In [59]:
# mering and joining dataframes
df1=pd.DataFrame({'Keys':['A','B','C'],'Value1':[1,2,3]})
df2=pd.DataFrame({'Keys':['A','B','C'],'Value1':[4,5,6]})
df1,df2

(  Keys  Value1
 0    A       1
 1    B       2
 2    C       3,
   Keys  Value1
 0    A       4
 1    B       5
 2    C       6)

In [60]:
# merging on the key ccolumns
pd.merge(df1,df2, on='Keys',how='inner')

  Keys  Value1_x  Value1_y
0    A         1         4
1    B         2         5
2    C         3         6